#                                Задание 1
#n = int(input())

#k = 0

#for i in range(n):

#    v = int(input())

#    if v == 1:
#        k += 1
#print(k if k<n/2 else n-k)

#-------------------------------------------------------------------------------------
#                                Задание 2
#a, b = map(int, input().split())
#c = 0
#for i in range(a + b):
#    if c:
#        break
#    for j in range(a + b):
#        if i + j == a and i * j == b:
#            c = 1
#            print(*sorted([i, j]))
#            break
#-------------------------------------------------------------------------------------
#                                Задание 3
#n=int(input())

#p=1

#while p<=n:

#    print(p,end=' ')

#    p=p*2
#-------------------------------------------------------------------------------------