                             #Задание номер 1
#--------------------------------------------------------------------------------------
#a = (input("Введите трехзначное число: "))

#b = int(a[0:1])

#c = int(a[1:2])

#e = int(a[2:3])

#print("Сумма чисел равна: " ,b + c + e)

                             #Задание номер 2
#--------------------------------------------------------------------------------------

#a = int(input("Введите число: "))

#Pet = int(a/3)

#kat = int (a/3*2)

#kos = int (a/3)

#print(Pet,kat,kos)

                             #Задание номер 3
#--------------------------------------------------------------------------------------
#a = int(input("Введи шестизначное число: "))

#b1 = a//1000

#one = b1//100

#two = b1%11

#free = b1%10

#b2 = a%1000

#four = b2//100

#five = b2%11

#six = b2%10
                                  #функция
#if (one+two+free)==(four+five+six):
#    print('Повезло')
#else:
#    print('Неповезло')
                             #Задание номер 4
#--------------------------------------------------------------------------------------

#n = int(input())

#m = int(input())

#k = int(input())
                             # функция
#if k < n * m and ((k % n == 0) or (k % m == 0)):
#    print('YES')
#else:
 #   print('NO')
# --------------------------------------------------------------------------------------